## Production: common
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**❌ &nbsp; Terraform Plan:** `failed`
**❌ &nbsp; Conftest:** `failed` 

<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # module.sns_sms_usage_report_sanitized_bucket.aws_s3_bucket.this will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "notification-canada-ca-production-sms-usage-logs-sanitized"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "CostCenter" = "notification-canada-ca-production"
          + "CostCentre" = "notification-canada-ca-production"
          + "Critical"   = "false"
          + "Terraform"  = "true"
        }
      + tags_all                    = {
          + "CostCenter" = "notification-canada-ca-production"
          + "CostCentre" = "notification-canada-ca-production"
          + "Critical"   = "false"
          + "Terraform"  = "true"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + server_side_encryption_configuration {
          + rule {
              + bucket_key_enabled = false

              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }
    }

  # module.sns_sms_usage_report_sanitized_bucket.aws_s3_bucket_public_access_block.this will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + s3_bucket_sms_usage_sanitized_id                    = (known after apply)

Warning: Argument is deprecated

  with aws_s3_bucket.csv_bucket,
  on s3.tf line 5, in resource "aws_s3_bucket" "csv_bucket":
   5: resource "aws_s3_bucket" "csv_bucket" {

Use the aws_s3_bucket_lifecycle_configuration resource instead

(and 71 more similar warnings elsewhere)
time=2024-04-24T14:13:46Z level=info msg=Executing hook: get-admin prefix=[/home/runner/work/notification-terraform/notification-terraform/env/production/common] 
Cloning into '/var/tmp/notification-admin'...

Error: expected length of bucket to be in the range (0 - 63), got notification-canada-ca-production-sms-usage-west-2-logs-sanitized

  with module.sns_sms_usage_report_sanitized_bucket_us_west_2.aws_s3_bucket.this,
  on .terraform/modules/sns_sms_usage_report_sanitized_bucket_us_west_2/S3/main.tf line 15, in resource "aws_s3_bucket" "this":
  15:   bucket        = var.bucket_name

time=2024-04-24T14:14:09Z level=error msg=Terraform invocation failed in /home/runner/work/notification-terraform/notification-terraform/env/production/common/.terragrunt-cache/51VQ8cOaCmus2jMgoFkn-vAqiTc/otNjPEaGW-4SZcUM-28oiXiKtfo/aws/common prefix=[/home/runner/work/notification-terraform/notification-terraform/env/production/common] 
time=2024-04-24T14:14:09Z level=info msg=Executing hook: cleanup-admin prefix=[/home/runner/work/notification-terraform/notification-terraform/env/production/common] 
time=2024-04-24T14:14:09Z level=error msg=1 error occurred:
	* exit status 1



```

</details>

